In [1]:
import pandas as pd
import os

In [4]:
df = pd.read_csv('../Data/ART_TPS.csv',nrows=432000)

In [5]:
df.head()

                  date       ART  TPS
0  2015-01-01 06:00:00  0.040652   72
1  2015-01-01 06:01:00  0.034940  181
2  2015-01-01 06:02:00  0.034568  131
3  2015-01-01 06:03:00  0.030225  144
4  2015-01-01 06:04:00  0.033751  176

In [7]:
df2 = df.loc[[i for j, i in enumerate(df.index) if j % 10 == 0]]

In [8]:
df2.head(20)

                    date       ART    TPS
0    2015-01-01 06:00:00  0.040652     72
10   2015-01-01 06:10:00  0.029742    234
20   2015-01-01 06:20:00  0.027795    256
30   2015-01-01 06:30:00  0.041529    178
40   2015-01-01 06:40:00  0.029053    356
50   2015-01-01 06:50:00  0.027905    349
60   2015-01-01 07:00:00  0.036553    460
70   2015-01-01 07:10:00  0.025745    563
80   2015-01-01 07:20:00  0.054337    653
90   2015-01-01 07:30:00  0.038327    721
100  2015-01-01 07:40:00  0.027604   1112
110  2015-01-01 07:50:00  0.040363   1599
120  2015-01-01 08:00:00  0.026410   1967
130  2015-01-01 08:10:00  0.030377   3101
140  2015-01-01 08:20:00  0.038193   4227
150  2015-01-01 08:30:00  0.028553   6088
160  2015-01-01 08:40:00  0.034176   8892
170  2015-01-01 08:50:00  0.039953  11126
180  2015-01-01 09:00:00  0.044612  13204
190  2015-01-01 09:10:00  0.040120  15224

In [10]:
df2.to_csv('../Data/ART_TPS_10m_p10min.csv', index=False)

In [12]:
df.drop(columns='NaN')

                        date   TPS       ART
0        2015-01-01 06:00:00    72  0.040652
1        2015-01-01 06:01:00   181  0.034940
2        2015-01-01 06:02:00   131  0.034568
3        2015-01-01 06:03:00   144  0.030225
4        2015-01-01 06:04:00   176  0.033751
...                      ...   ...       ...
1044155  2018-01-01 05:58:00   877  0.035228
1044156  2018-01-01 05:59:00   744  0.034766
1044157  2018-01-01 06:00:00   848  0.035314
1044158  2018-01-01 06:01:00  1179  0.043263
1044159  2018-01-01 06:02:00   557  0.041368

[1044160 rows x 3 columns]

In [13]:
columns_titles = ["date","ART","TPS"]
df=df.reindex(columns=columns_titles)

In [14]:
df.head()

                  date       ART  TPS
0  2015-01-01 06:00:00  0.040652   72
1  2015-01-01 06:01:00  0.034940  181
2  2015-01-01 06:02:00  0.034568  131
3  2015-01-01 06:03:00  0.030225  144
4  2015-01-01 06:04:00  0.033751  176

In [6]:
df.to_csv('../Data/ART_TPS_10m.csv', index=False)